In [1]:
import pandas as pd
import numpy as np

## Read json

In [2]:
df = pd.read_json('../../datasets/auto.json', orient = 'records')
df

        CarNumber  Refund         Fines    Make    Model
0    Y163O8161RUS       2   3200.000000    Ford    Focus
1     E432XX77RUS       1   6500.000000  Toyota    Camry
2     7184TT36RUS       1   2100.000000    Ford    Focus
3    X582HE161RUS       2   2000.000000    Ford    Focus
4    92918M178RUS       1   5700.000000    Ford    Focus
..            ...     ...           ...     ...      ...
720  Y163O8161RUS       2   1600.000000    Ford    Focus
721  M0309X197RUS       1  22300.000000    Ford    Focus
722  O673E8197RUS       2    600.000000    Ford    Focus
723  8610T8154RUS       1   2000.000000    Ford    Focus
724  H419XE197RUS       2   8594.586466  Toyota  Corolla

[725 rows x 5 columns]

In [3]:
pd.options.display.float_format = '{:.2f}'.format
df

        CarNumber  Refund    Fines    Make    Model
0    Y163O8161RUS       2  3200.00    Ford    Focus
1     E432XX77RUS       1  6500.00  Toyota    Camry
2     7184TT36RUS       1  2100.00    Ford    Focus
3    X582HE161RUS       2  2000.00    Ford    Focus
4    92918M178RUS       1  5700.00    Ford    Focus
..            ...     ...      ...     ...      ...
720  Y163O8161RUS       2  1600.00    Ford    Focus
721  M0309X197RUS       1 22300.00    Ford    Focus
722  O673E8197RUS       2   600.00    Ford    Focus
723  8610T8154RUS       1  2000.00    Ford    Focus
724  H419XE197RUS       2  8594.59  Toyota  Corolla

[725 rows x 5 columns]

In [4]:
df['Model'].isna().sum()

np.int64(9)

In [5]:
df.count()

CarNumber    725
Refund       725
Fines        725
Make         725
Model        716
dtype: int64

## add sample

In [6]:
np.random.seed(21)
valid = df[['CarNumber', 'Make', 'Model']].drop_duplicates()
sampler = valid.sample(n=200, replace = True, random_state = 21)
sample_fines = df['Fines'].sample(n=200, replace = True, random_state = 21).values
sample_refund = df['Fines'].sample(n=200, replace = True, random_state = 21).values
sample = pd.DataFrame({'CarNumber': sampler['CarNumber'].values,
                            'Make': sampler['Make'].values,
                            'Model': sampler['Model'].values,
                            'Fines': sample_fines,
                            'Refund': sample_refund})
concat_rows = pd.concat([df,sample]).reset_index(drop=True)

In [7]:
concat_rows
print(concat_rows.count())

CarNumber    925
Refund       925
Fines        925
Make         925
Model        913
dtype: int64

## Concanenate to fines

In [8]:
np.random.seed(21)
years = np.random.randint(1980, 2020, size=len(concat_rows))
series = pd.Series(years, name='Year')
fines = pd.concat([concat_rows, series], axis=1)
fines

        CarNumber   Refund    Fines        Make  Model  Year
0    Y163O8161RUS     2.00  3200.00        Ford  Focus  1989
1     E432XX77RUS     1.00  6500.00      Toyota  Camry  1995
2     7184TT36RUS     1.00  2100.00        Ford  Focus  1984
3    X582HE161RUS     2.00  2000.00        Ford  Focus  2015
4    92918M178RUS     1.00  5700.00        Ford  Focus  2014
..            ...      ...      ...         ...    ...   ...
920   X782CO96RUS  2000.00  2000.00        Ford  Focus  1981
921  E79988152RUS   400.00   400.00        Ford  Focus  1992
922  X582HE161RUS 12800.00 12800.00        Ford  Focus  2007
923  9594HY161RUS   800.00   800.00        Ford  Focus  2005
924  K327T8197RUS  2200.00  2200.00  Volkswagen   Golf  1997

[925 rows x 6 columns]

In [9]:
fines.count()

CarNumber    925
Refund       925
Fines        925
Make         925
Model        913
Year         925
dtype: int64

### Read Surname json and create new dataframe

In [10]:
surnames = pd.read_json('../../datasets/surname.json')
surnames.columns = surnames.iloc[0]
surnames = surnames.iloc[1:]
surnames = surnames.reset_index(drop=True)
surnames

0       NAME    COUNT RANK
0      ADAMS   427865   42
1      ALLEN   482607   33
2    ALVAREZ   233983   92
3   ANDERSON   784404   15
4     BAILEY   277845   72
..       ...      ...  ...
95  WILLIAMS  1625252    3
96    WILSON   801882   14
97      WOOD   250715   84
98    WRIGHT   458980   35
99     YOUNG   484447   32

[100 rows x 3 columns]

In [11]:
np.random.seed(21)
unique_nums = concat_rows['CarNumber'].unique()
r_surnames = np.random.choice(surnames['NAME'], size = len(unique_nums), replace = True)

In [12]:
owners = pd.DataFrame({'CarNumber': unique_nums,
                       'SURNAME': r_surnames})
owners

        CarNumber     SURNAME
0    Y163O8161RUS  RICHARDSON
1     E432XX77RUS        ROSS
2     7184TT36RUS      MORGAN
3    X582HE161RUS      BAILEY
4    92918M178RUS       LOPEZ
..            ...         ...
526  O136HO197RUS    CAMPBELL
527  O22097197RUS        HALL
528  M0309X197RUS       BAKER
529  O673E8197RUS        DIAZ
530  8610T8154RUS      MORGAN

[531 rows x 2 columns]

### New data concat

In [13]:
new_data = pd.DataFrame({
    'CarNumber': ['A111AA111RUS', 'B222BB222RUS', 'C333CC333RUS', 'D444DD444RUS', 'E555EE555RUS'],
    'Refund': [1.00, 2.00, 1.00, 2.00, 1.00],
    'Fines': [4500.00, 3200.00, 2800.00, 5100.00, 3900.00],
    'Make': ['Tesla', 'Ford', 'Volkswagen', 'Lexus', 'Volvo'],
    'Model': ['Model 3', 'Bronco', 'Terramont', 'LFA', 'XC 90'],
    'Year': [2010, 2015, 2018, 2012, 2017]
})
fines = pd.concat([fines,new_data], ignore_index = True)
fines

        CarNumber  Refund   Fines        Make      Model  Year
0    Y163O8161RUS    2.00 3200.00        Ford      Focus  1989
1     E432XX77RUS    1.00 6500.00      Toyota      Camry  1995
2     7184TT36RUS    1.00 2100.00        Ford      Focus  1984
3    X582HE161RUS    2.00 2000.00        Ford      Focus  2015
4    92918M178RUS    1.00 5700.00        Ford      Focus  2014
..            ...     ...     ...         ...        ...   ...
925  A111AA111RUS    1.00 4500.00       Tesla    Model 3  2010
926  B222BB222RUS    2.00 3200.00        Ford     Bronco  2015
927  C333CC333RUS    1.00 2800.00  Volkswagen  Terramont  2018
928  D444DD444RUS    2.00 5100.00       Lexus        LFA  2012
929  E555EE555RUS    1.00 3900.00       Volvo      XC 90  2017

[930 rows x 6 columns]

In [14]:
owners = owners.iloc[:-20]
new_owners = pd.DataFrame({
    'CarNumber': ['F666FF666RUS', 'G777GG777RUS', 'H888HH888RUS'],
    'SURNAME': ['ZAICEV', 'SMIRNOV', 'ANTONOV']
})
owners = pd.concat([owners, new_owners], ignore_index = True)
owners

        CarNumber     SURNAME
0    Y163O8161RUS  RICHARDSON
1     E432XX77RUS        ROSS
2     7184TT36RUS      MORGAN
3    X582HE161RUS      BAILEY
4    92918M178RUS       LOPEZ
..            ...         ...
509  O50197197RUS      WRIGHT
510  7608EE777RUS        HILL
511  F666FF666RUS      ZAICEV
512  G777GG777RUS     SMIRNOV
513  H888HH888RUS     ANTONOV

[514 rows x 2 columns]

### Inner join

In [15]:
inner = pd.merge(fines, owners, on='CarNumber', how='inner')
inner

        CarNumber   Refund    Fines        Make  Model  Year     SURNAME
0    Y163O8161RUS     2.00  3200.00        Ford  Focus  1989  RICHARDSON
1     E432XX77RUS     1.00  6500.00      Toyota  Camry  1995        ROSS
2     7184TT36RUS     1.00  2100.00        Ford  Focus  1984      MORGAN
3    X582HE161RUS     2.00  2000.00        Ford  Focus  2015      BAILEY
4    92918M178RUS     1.00  5700.00        Ford  Focus  2014       LOPEZ
..            ...      ...      ...         ...    ...   ...         ...
892   X782CO96RUS  2000.00  2000.00        Ford  Focus  1981    CASTILLO
893  E79988152RUS   400.00   400.00        Ford  Focus  1992       ALLEN
894  X582HE161RUS 12800.00 12800.00        Ford  Focus  2007      BAILEY
895  9594HY161RUS   800.00   800.00        Ford  Focus  2005     BENNETT
896  K327T8197RUS  2200.00  2200.00  Volkswagen   Golf  1997      TURNER

[897 rows x 7 columns]

### Outer join

In [16]:
outer = pd.merge(fines, owners, on='CarNumber', how='outer')
outer

        CarNumber  Refund    Fines  Make  Model    Year   SURNAME
0    704687163RUS    2.00  1400.00  Ford  Focus 2004.00     ADAMS
1    704787163RUS    2.00  2800.00  Ford  Focus 1992.00    MORGAN
2    704987163RUS    2.00  8594.59  Ford  Focus 1985.00  MITCHELL
3    705287163RUS    2.00  2000.00  Ford  Focus 1980.00     GOMEZ
4    705387163RUS    2.00   700.00  Ford  Focus 1987.00   STEWART
..            ...     ...      ...   ...    ...     ...       ...
928  Y969O8197RUS    1.00 15600.00  Ford  Focus 1988.00     LOPEZ
929  Y969O8197RUS    2.00  7800.00  Ford  Focus 1992.00     LOPEZ
930  Y973O8197RUS    2.00  8594.59  Ford  Focus 2005.00     YOUNG
931  Y973O8197RUS    1.00 34800.00  Ford  Focus 2003.00     YOUNG
932  Y973O8197RUS    1.00 69600.00  Ford  Focus 2017.00     YOUNG

[933 rows x 7 columns]

### Left join

In [17]:
left = pd.merge(fines, owners, on='CarNumber', how='left')
left

        CarNumber  Refund   Fines        Make      Model  Year     SURNAME
0    Y163O8161RUS    2.00 3200.00        Ford      Focus  1989  RICHARDSON
1     E432XX77RUS    1.00 6500.00      Toyota      Camry  1995        ROSS
2     7184TT36RUS    1.00 2100.00        Ford      Focus  1984      MORGAN
3    X582HE161RUS    2.00 2000.00        Ford      Focus  2015      BAILEY
4    92918M178RUS    1.00 5700.00        Ford      Focus  2014       LOPEZ
..            ...     ...     ...         ...        ...   ...         ...
925  A111AA111RUS    1.00 4500.00       Tesla    Model 3  2010         NaN
926  B222BB222RUS    2.00 3200.00        Ford     Bronco  2015         NaN
927  C333CC333RUS    1.00 2800.00  Volkswagen  Terramont  2018         NaN
928  D444DD444RUS    2.00 5100.00       Lexus        LFA  2012         NaN
929  E555EE555RUS    1.00 3900.00       Volvo      XC 90  2017         NaN

[930 rows x 7 columns]

### Right join

In [18]:
right = pd.merge(fines, owners, on='CarNumber', how='right')
right

        CarNumber   Refund    Fines    Make    Model    Year     SURNAME
0    Y163O8161RUS     2.00  3200.00    Ford    Focus 1989.00  RICHARDSON
1    Y163O8161RUS     2.00  1600.00    Ford    Focus 1980.00  RICHARDSON
2    Y163O8161RUS 27000.00 27000.00    Ford    Focus 2017.00  RICHARDSON
3    Y163O8161RUS   800.00   800.00    Ford    Focus 2004.00  RICHARDSON
4     E432XX77RUS     1.00  6500.00  Toyota    Camry 1995.00        ROSS
..            ...      ...      ...     ...      ...     ...         ...
895  7608EE777RUS     1.00  4000.00   Skoda  Octavia 2000.00        HILL
896  7608EE777RUS   500.00   500.00   Skoda  Octavia 1988.00        HILL
897  F666FF666RUS      NaN      NaN     NaN      NaN     NaN      ZAICEV
898  G777GG777RUS      NaN      NaN     NaN      NaN     NaN     SMIRNOV
899  H888HH888RUS      NaN      NaN     NaN      NaN     NaN     ANTONOV

[900 rows x 7 columns]

In [19]:
len(owners)

514

In [20]:
table = pd.pivot_table( data = fines,
                       values = 'Fines',
                       index = ['Make', 'Model'],
                       columns = 'Year',
                       aggfunc = 'sum',
                       fill_value= np.nan)
table

Year                     1980      1981      1982     1983      1984  \
Make       Model
Ford       Bronco         NaN       NaN       NaN      NaN       NaN
           Focus     56489.17 398589.17 140383.76 62300.00 112494.59
           Mondeo         NaN       NaN       NaN      NaN       NaN
Lexus      LFA            NaN       NaN       NaN      NaN       NaN
Skoda      Octavia    1900.00       NaN   6900.00 11594.59       NaN
Tesla      Model 3        NaN       NaN       NaN      NaN       NaN
Toyota     Camry     28500.00   8594.59       NaN  7200.00       NaN
           Corolla        NaN       NaN   2000.00   800.00       NaN
Volkswagen Golf      30900.00       NaN       NaN  8594.59    300.00
           Jetta          NaN       NaN       NaN      NaN       NaN
           Passat     6500.00   1600.00       NaN  3200.00  10000.00
           Terramont      NaN       NaN       NaN      NaN       NaN
           Touareg        NaN       NaN       NaN      NaN       NaN
Volvo      XC 90          NaN       NaN       NaN      NaN       NaN

Year                      1985      1986      1987     1988      1989  ...  \
Make       Model                                                       ...
Ford       Bronco          NaN       NaN       NaN      NaN       NaN  ...
           Focus     189583.76 104994.59 132800.00 95489.17 125700.00  ...
           Mondeo          NaN       NaN       NaN      NaN   8600.00  ...
Lexus      LFA             NaN       NaN       NaN      NaN       NaN  ...
Skoda      Octavia    10294.59    600.00   5200.00   500.00  91400.00  ...
Tesla      Model 3         NaN       NaN       NaN      NaN       NaN  ...
Toyota     Camry           NaN       NaN       NaN      NaN  22400.00  ...
           Corolla         NaN       NaN   8000.00      NaN   4000.00  ...
Volkswagen Golf       24000.00       NaN   9300.00      NaN   5800.00  ...
           Jetta           NaN       NaN       NaN      NaN       NaN  ...
           Passat      5000.00  15000.00  12300.00      NaN       NaN  ...
           Terramont       NaN       NaN       NaN      NaN       NaN  ...
           Touareg     5800.00       NaN       NaN      NaN       NaN  ...
Volvo      XC 90           NaN       NaN       NaN      NaN       NaN  ...

Year                      2010     2011      2012      2013      2014  \
Make       Model
Ford       Bronco          NaN      NaN       NaN       NaN       NaN
           Focus     120183.76 86689.17 120200.00 149294.59 157494.59
           Mondeo          NaN      NaN  34400.00       NaN       NaN
Lexus      LFA             NaN      NaN   5100.00       NaN       NaN
Skoda      Octavia     3100.00   500.00    500.00  19594.59   3300.00
Tesla      Model 3     4500.00      NaN       NaN       NaN       NaN
Toyota     Camry           NaN  3300.00  10594.59       NaN       NaN
           Corolla    24000.00  8594.59       NaN       NaN       NaN
Volkswagen Golf            NaN   300.00       NaN       NaN       NaN
           Jetta           NaN      NaN       NaN       NaN       NaN
           Passat      2800.00      NaN       NaN       NaN       NaN
           Terramont       NaN      NaN       NaN       NaN       NaN
           Touareg     6300.00      NaN       NaN       NaN   1300.00
Volvo      XC 90           NaN      NaN       NaN       NaN       NaN

Year                      2015     2016      2017      2018      2019
Make       Model
Ford       Bronco      3200.00      NaN       NaN       NaN       NaN
           Focus     210789.17 83694.59 268200.00 283594.59 117100.00
           Mondeo          NaN 48100.00       NaN       NaN       NaN
Lexus      LFA             NaN      NaN       NaN       NaN       NaN
Skoda      Octavia    46394.59   300.00   4000.00 156200.00   9500.00
Tesla      Model 3         NaN      NaN       NaN       NaN       NaN
Toyota     Camry           NaN      NaN   1000.00  13000.00  18100.00
           Corolla         NaN      NaN   9600.00       NaN       NaN
Volkswagen Golf        2300.00      NaN       NaN       NaN       NaN
           Jetta           NaN      NaN       NaN       NaN       NaN
           Passat       600.00  2100.00       NaN       NaN       NaN
           Terramont       NaN      NaN       NaN   2800.00       NaN
           Touareg      500.00      NaN       NaN       NaN       NaN
Volvo      XC 90           NaN      NaN   3900.00       NaN       NaN

[14 rows x 40 columns]

In [21]:
fines.to_csv('../../datasets/fines.csv', index = False)
owners.to_csv('../../datasets/owners.csv', index = False)

In [22]:
concat_rows.count()

CarNumber    925
Refund       925
Fines        925
Make         925
Model        913
dtype: int64